In [34]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [35]:
# Read the CSV files into DataFrames.
sales_2020 = pd.read_csv('Resources/athletic_sales_2020.csv')
sales_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [36]:
# Display the 2020 sales DataFrame
sales_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [37]:
# Display the 2021 sales DataFrame
sales_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [38]:
# Check the 2020 sales data types.
sales_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1297 entries, 0 to 1296
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          1297 non-null   object
 1   retailer_id       1297 non-null   int64
 2   invoice_date      1297 non-null   object
 3   region            1297 non-null   object
 4   state             1297 non-null   object
 5   city              1297 non-null   object
 6   product           1297 non-null   object
 7   price_per_unit    1297 non-null   int64
 8   units_sold        1297 non-null   int64
 9   total_sales       1297 non-null   int64
 10  operating_profit  1297 non-null   float64
 11  sales_method      1297 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 121.7+ KB

In [39]:
# Check the 2021 sales data types.
sales_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8346 entries, 0 to 8345
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          8346 non-null   object
 1   retailer_id       8346 non-null   int64
 2   invoice_date      8346 non-null   object
 3   region            8346 non-null   object
 4   state             8346 non-null   object
 5   city              8346 non-null   object
 6   product           8346 non-null   object
 7   price_per_unit    8346 non-null   int64
 8   units_sold        8346 non-null   int64
 9   total_sales       8346 non-null   int64
 10  operating_profit  8346 non-null   float64
 11  sales_method      8346 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 782.6+ KB

#### Combine the sales data by rows.

In [40]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_sales = pd.concat([sales_2020, sales_2021]).reset_index(drop=True)

In [41]:
# Check if any values are null.
combined_sales.isnull().sum()

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [47]:
# Check the data type of each column
combined_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9643 entries, 0 to 9642
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9643 non-null   object
 1   retailer_id       9643 non-null   int64
 2   invoice_date      9643 non-null   datetime64[ns]
 3   region            9643 non-null   object
 4   state             9643 non-null   object
 5   city              9643 non-null   object
 6   product           9643 non-null   object
 7   price_per_unit    9643 non-null   int64
 8   units_sold        9643 non-null   int64
 9   total_sales       9643 non-null   int64
 10  operating_profit  9643 non-null   float64
 11  sales_method      9643 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(4), object(6)
memory usage: 904.2+ KB

In [43]:
# Convert the "invoice_date" to a datetime datatype
combined_sales['invoice_date'] = pd.to_datetime(combined_sales['invoice_date'])

/var/folders/_8/vwqz873x1nqfqy7ffnk43r080000gn/T/ipykernel_62326/1368169339.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_sales['invoice_date'] = pd.to_datetime(combined_sales['invoice_date'])

In [44]:
# Confirm that the "invoice_date" data type has been changed.
combined_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9643 entries, 0 to 9642
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   retailer          9643 non-null   object
 1   retailer_id       9643 non-null   int64
 2   invoice_date      9643 non-null   datetime64[ns]
 3   region            9643 non-null   object
 4   state             9643 non-null   object
 5   city              9643 non-null   object
 6   product           9643 non-null   object
 7   price_per_unit    9643 non-null   int64
 8   units_sold        9643 non-null   int64
 9   total_sales       9643 non-null   int64
 10  operating_profit  9643 non-null   float64
 11  sales_method      9643 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(4), object(6)
memory usage: 904.2+ KB

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [49]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".

grouped_sales = combined_sales.groupby(['region', 'state', 'city'])['units_sold'].sum().reset_index()
grouped_sales = grouped_sales.rename(columns={'units_sold': 'Total Products Sold', 'region': 'Region', 'state': 'State', 'city': 'City'})
grouped_sales.sort_values(by='Total Products Sold', ascending=False, inplace=True)
grouped_sales.reset_index(drop=True, inplace=True)
grouped_sales.head(5)

# Show the top 5 results.

      Region       State           City  Total Products Sold
0  Northeast    New York       New York               111954
1      South       Texas        Houston                90322
2       West  California  San Francisco                85478
3       West  California    Los Angeles                76384
4  Southeast     Florida          Miami                73135

#### Using `pivot_table`

In [53]:
# Show the number products sold for region, state, and city.
combinded_sales_pivot = combined_sales.pivot_table(index=['region', 'state', 'city'], values='units_sold', aggfunc='sum').reset_index()

# Rename the "units_sold" column to "Total_Products_Sold"
combinded_sales_pivot = combinded_sales_pivot.rename(columns={'units_sold': 'Total Products Sold'})
combinded_sales_pivot = combinded_sales_pivot.rename(columns={'region': 'Region', 'state': 'State', 'city': 'City'})

# Show the top 5 results.
combinded_sales_pivot.sort_values(by='Total Products Sold', ascending=False, inplace=True)
combinded_sales_pivot.reset_index(drop=True, inplace=True)
combinded_sales_pivot.head(5)

      Region       State           City  Total Products Sold
0  Northeast    New York       New York               111954
1      South       Texas        Houston                90322
2       West  California  San Francisco                85478
3       West  California    Los Angeles                76384
4  Southeast     Florida          Miami                73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [55]:
# Show the total sales for the products sold for each region, state, and city.
combinded_sales_pivot.groupby(['Region', 'State', 'City'])['Total Products Sold'].sum().reset_index()


# Rename the "total_sales" column to "Total Sales"
combinded_sales_pivot = combinded_sales_pivot.rename(columns={'Total Products Sold': 'Total Sales'})

# Show the top 5 results.
combinded_sales_pivot.sort_values(by='Total Sales', ascending=False, inplace=True)
combinded_sales_pivot.reset_index(drop=True, inplace=True)  
combinded_sales_pivot.head(5)

      Region       State           City  Total Sales
0  Northeast    New York       New York       111954
1      South       Texas        Houston        90322
2       West  California  San Francisco        85478
3       West  California    Los Angeles        76384
4  Southeast     Florida          Miami        73135

#### Using `pivot_table`

In [58]:
# Show the total sales for the products sold for each region, state, and city.
grouped_sales = combinded_sales_pivot.groupby(['Region', 'State', 'City'])['Total Sales'].sum().reset_index()

# Optional: Rename the "total_sales" column to "Total Sales"

# Show the top 5 results.
grouped_sales.sort_values(by='Total Sales', ascending=False, inplace=True)
grouped_sales.reset_index(drop=True, inplace=True)
grouped_sales.head(5)

      Region       State           City  Total Sales
0  Northeast    New York       New York       111954
1      South       Texas        Houston        90322
2       West  California  San Francisco        85478
3       West  California    Los Angeles        76384
4  Southeast     Florida          Miami        73135

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [59]:
# Show the total sales for the products sold for each retailer, region, state, and city.
retailer_sales = combined_sales.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index()

# Rename the "total_sales" column to "Total Sales"
retailer_sales = retailer_sales.rename(columns={'units_sold': 'Total Sales'})
retailer_sales = retailer_sales.rename(columns={'retailer': 'Retailer', 'region': 'Region', 'state': 'State', 'city': 'City'})

# Show the top 5 results.
retailer_sales.sort_values(by='Total Sales', ascending=False, inplace=True)
retailer_sales.reset_index(drop=True, inplace=True)
retailer_sales.head(5)

        Retailer     Region       State           City  Total Sales
0      West Gear       West  California  San Francisco        81233
1         Kohl's       West  California    Los Angeles        74543
2    Foot Locker  Northeast    New York       New York        72196
3  Sports Direct      South       Texas         Dallas        67683
4        Walmart      South       Texas        Houston        65072

#### Using `pivot_table`

In [61]:
# Show the total sales for the products sold for each retailer, region, state, and city.
retailer_pivot = combined_sales.pivot_table(index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum').reset_index()    


# Optional: Rename the "total_sales" column to "Total Sales"
retailer_pivot = retailer_pivot.rename(columns={'units_sold': 'Total Sales'})
retailer_pivot = retailer_pivot.rename(columns={'retailer': 'Retailer', 'region': 'Region', 'state': 'State', 'city': 'City'})  

# Show the top 5 results.
retailer_pivot.sort_values(by='Total Sales', ascending=False, inplace=True)
retailer_pivot.reset_index(drop=True, inplace=True)
retailer_pivot.head(5)

        Retailer     Region       State           City  Total Sales
0      West Gear       West  California  San Francisco        81233
1         Kohl's       West  California    Los Angeles        74543
2    Foot Locker  Northeast    New York       New York        72196
3  Sports Direct      South       Texas         Dallas        67683
4        Walmart      South       Texas        Houston        65072

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [74]:
# Filter the sales data to get the women's athletic footwear sales data.
retailer_footwear = combined_sales[combined_sales['product'] == 'Women\'s Athletic Footwear']
retailer_footwear.reset_index(drop=True, inplace=True)
retailer_footwear.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
1,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
2,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
3,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
4,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

#### Using `groupby`

In [75]:
# Group the data and store the result
grouped_retailer_footwear = retailer_footwear.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index()

# Rename the columns
grouped_retailer_footwear = grouped_retailer_footwear.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold', 'retailer': 'Retailer', 'region': 'Region', 'state': 'State', 'city': 'City'})

# Sort the data and reset the index
grouped_retailer_footwear.sort_values(by='Womens_Footwear_Units_Sold', ascending=False, inplace=True)   
grouped_retailer_footwear.reset_index(drop=True, inplace=True)

# Show the top 5 results
grouped_retailer_footwear.head(5)

,Retailer,Region,State,City,Womens_Footwear_Units_Sold
0,West Gear,West,California,San Francisco,12107
1,Foot Locker,Northeast,New York,New York,10996
2,Kohl's,West,California,Los Angeles,10826
3,Foot Locker,Southeast,South Carolina,Charleston,8814
4,Sports Direct,South,Texas,Dallas,8790

#### Using `pivot_table`

In [76]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
womens_pivot = retailer_footwear.pivot_table(index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum').reset_index()

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
womens_pivot = womens_pivot.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold', 'retailer': 'Retailer', 'region': 'Region', 'state': 'State', 'city': 'City'})


# Show the top 5 results.
womens_pivot.sort_values(by='Womens_Footwear_Units_Sold', ascending=False, inplace=True)
womens_pivot.reset_index(drop=True, inplace=True)
womens_pivot.head(5)

,Retailer,Region,State,City,Womens_Footwear_Units_Sold
0,West Gear,West,California,San Francisco,12107
1,Foot Locker,Northeast,New York,New York,10996
2,Kohl's,West,California,Los Angeles,10826
3,Foot Locker,Southeast,South Carolina,Charleston,8814
4,Sports Direct,South,Texas,Dallas,8790

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [81]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
day_pivot = combined_sales.pivot_table(index='invoice_date', values='total_sales')

# Optional: Rename the "total_sales" column to "Total Sales"
day_pivot = day_pivot.rename(columns={'total_sales': 'Total Sales'})

# Show the table.
day_pivot.head()

                Total Sales
invoice_date
2020-01-01    140856.833333
2020-01-02    114901.666667
2020-01-03    105428.833333
2020-01-04    102513.333333
2020-01-05    117971.500000

In [88]:
# Resample the pivot table into daily bins, and get the total sales for each day.
day_pivot_sample = day_pivot.resample('D').sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
day_pivot_sample.sort_values(by='Total Sales', ascending=False, inplace=True)
day_pivot_sample.head()

              Total Sales
invoice_date
2020-09-17       374745.0
2020-06-30       346418.0
2020-07-01       338723.5
2020-07-07       338055.0
2020-07-08       308085.0

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [90]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
week_pivot_sample = day_pivot.resample('W').sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
week_pivot_sample.sort_values(by='Total Sales', ascending=False, inplace=True)
week_pivot_sample.head()

              Total Sales
invoice_date
2020-07-05      1880870.5
2020-07-12      1787918.5
2020-10-04      1627700.5
2020-09-20      1602208.1
2020-09-27      1557547.5